cybersyn-stm/Learn_STM32/STM32F103RC/harware study/VK36N16I - 副本/DRIVE/I2C.h
#ifndef _I2C_H_
#define _I2C_H_

#include "stm32f10x.h"

#define I2C_PIN_LOW 0
#define I2C_PIN_HIGH 1


typedef void (*I2C_SETTING_INIT_CALLBACK_T)(void);
typedef void (*I2C_PIN_WRITE_CALLBACK_T)(uint8_t data);
typedef uint8_t (*I2C_PIN_READ_CALLBACK_T)(void);
typedef void (*I2C_DELAY_US_CALLACK_T)(uint32_t MICROSECONDS);
typedef struct{
	I2C_SETTING_INIT_CALLBACK_T I2C_SETTING_INIT;
	I2C_PIN_READ_CALLBACK_T SDA_READ;
	I2C_PIN_WRITE_CALLBACK_T SDA_WRITE;	
	I2C_PIN_WRITE_CALLBACK_T SCL_WRITE;
	I2C_DELAY_US_CALLACK_T DELAY_US;
}I2C_T;
							
void I2C_START(I2C_T *i2c_t);
void I2C_STOP(I2C_T *i2c_t);		
void I2C_ACK(I2C_T *i2c_t);
void I2C_WRITE_BYTE(I2C_T *i2c_t,uint8_t data);
uint8_t I2C_READ_BYTE(I2C_T *i2c_t);
void I2C_SEND_SSD1306(I2C_T *i2c_t,uint8_t device_address,uint8_t data_or_command,uint8_t data);
#endif 

